; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v5 ?v1)
             (pred_10 ?v13 ?v11)
             (pred_4 ?v5 ?v11)
             (pred_1 ?v2 ?v5 )
	     (pred_12 ?v5)
             (pred_7 ?v4)
             (pred_11 ?v13)
             (pred_6 ?v11)
             (pred_5 ?v5)
             (pred_2 ?v13)
             (pred_3 ?v5)
             (pred_8 ))



(:action op_2
:parameters (?v9 ?v10 ?v3 ?v6)
:precondition (and (pred_7 ?v9) (pred_7 ?v10) (pred_11 ?v3) (pred_6 ?v6)
          (pred_9 ?v9 ?v10) (pred_10 ?v3 ?v6)
                   (pred_4 ?v10 ?v6) (pred_12 ?v9) 
                   (pred_5 ?v10) (pred_2 ?v3))
:effect (and  (pred_3 ?v10) (not (pred_5 ?v10))))


(:action op_4
:parameters (?v9 ?v7)
:precondition (and (pred_7 ?v9) (pred_7 ?v7)
               (pred_12 ?v9) (pred_9 ?v9 ?v7) (pred_3 ?v7))
:effect (and (pred_12 ?v7) (not (pred_12 ?v9))))

(:action op_1
:parameters (?v9 ?v3)
:precondition (and (pred_7 ?v9) (pred_11 ?v3) 
                  (pred_12 ?v9) (pred_1 ?v3 ?v9) (pred_8 ))
:effect (and (pred_2 ?v3)
   (not (pred_1 ?v3 ?v9)) (not (pred_8 ))))


(:action op_5
:parameters (?v9 ?v12 ?v8)
:precondition (and (pred_7 ?v9) (pred_11 ?v12) (pred_11 ?v8)
                  (pred_12 ?v9) (pred_2 ?v8) (pred_1 ?v12 ?v9))
:effect (and (pred_2 ?v12) (pred_1 ?v8 ?v9)
        (not (pred_2 ?v8)) (not (pred_1 ?v12 ?v9))))

(:action op_3
:parameters (?v9 ?v3)
:precondition (and (pred_7 ?v9) (pred_11 ?v3) 
                  (pred_12 ?v9) (pred_2 ?v3))
:effect (and (pred_8 ) (pred_1 ?v3 ?v9) (not (pred_2 ?v3)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_14 obj_19 obj_10 obj_17 obj_01 obj_11 obj_05 obj_08 obj_12 obj_02 obj_07 obj_20 obj_09 obj_04 obj_03 obj_06
    obj_18 obj_16
    obj_13 obj_15
    )

    (:init
       (pred_8)

       (pred_7 obj_14)
       (pred_7 obj_19)
       (pred_7 obj_10)
       (pred_7 obj_17)
       (pred_7 obj_01)
       (pred_7 obj_11)
       (pred_7 obj_05)
       (pred_7 obj_08)
       (pred_7 obj_12)
       (pred_7 obj_02)
       (pred_7 obj_07)
       (pred_7 obj_20)
       (pred_7 obj_09)
       (pred_7 obj_04)
       (pred_7 obj_03)
       (pred_7 obj_06)
       (pred_6 obj_18)
       (pred_6 obj_16)
       (pred_11 obj_13)
       (pred_11 obj_15)

       (pred_9 obj_14 obj_01)
       (pred_9 obj_14 obj_19)
       (pred_9 obj_19 obj_11)
       (pred_9 obj_19 obj_10)
       (pred_9 obj_19 obj_14)
       (pred_9 obj_10 obj_05)
       (pred_9 obj_10 obj_17)
       (pred_9 obj_10 obj_19)
       (pred_9 obj_17 obj_08)
       (pred_9 obj_17 obj_10)
       (pred_9 obj_01 obj_12)
       (pred_9 obj_01 obj_11)
       (pred_9 obj_01 obj_14)
       (pred_9 obj_11 obj_02)
       (pred_9 obj_11 obj_05)
       (pred_9 obj_11 obj_19)
       (pred_9 obj_11 obj_01)
       (pred_9 obj_05 obj_07)
       (pred_9 obj_05 obj_08)
       (pred_9 obj_05 obj_10)
       (pred_9 obj_05 obj_11)
       (pred_9 obj_08 obj_20)
       (pred_9 obj_08 obj_17)
       (pred_9 obj_08 obj_05)
       (pred_9 obj_12 obj_09)
       (pred_9 obj_12 obj_02)
       (pred_9 obj_12 obj_01)
       (pred_9 obj_02 obj_04)
       (pred_9 obj_02 obj_07)
       (pred_9 obj_02 obj_11)
       (pred_9 obj_02 obj_12)
       (pred_9 obj_07 obj_03)
       (pred_9 obj_07 obj_20)
       (pred_9 obj_07 obj_05)
       (pred_9 obj_07 obj_02)
       (pred_9 obj_20 obj_06)
       (pred_9 obj_20 obj_08)
       (pred_9 obj_20 obj_07)
       (pred_9 obj_09 obj_04)
       (pred_9 obj_09 obj_12)
       (pred_9 obj_04 obj_03)
       (pred_9 obj_04 obj_02)
       (pred_9 obj_04 obj_09)
       (pred_9 obj_03 obj_06)
       (pred_9 obj_03 obj_07)
       (pred_9 obj_03 obj_04)
       (pred_9 obj_06 obj_20)
       (pred_9 obj_06 obj_03)
       (pred_5 obj_11)
       (pred_5 obj_14)
       (pred_4  obj_11 obj_18)
       (pred_4  obj_14 obj_16)
       (pred_3 obj_19)
       (pred_3 obj_10)
       (pred_3 obj_17)
       (pred_3 obj_01)
       (pred_3 obj_05)
       (pred_3 obj_08)
       (pred_3 obj_12)
       (pred_3 obj_02)
       (pred_3 obj_07)
       (pred_3 obj_20)
       (pred_3 obj_09)
       (pred_3 obj_04)
       (pred_3 obj_03)
       (pred_3 obj_06)

       (pred_10  obj_13 obj_18)
       (pred_10  obj_15 obj_16)
       (pred_1 obj_13 obj_19)
       (pred_1 obj_15 obj_01)
       (pred_12 obj_10)
    )

    (:goal (and
       (pred_1 obj_15 obj_12)
    ))
(:constraints
  (always (not (pred_12 obj_07)))
)
)

; plan
1. (op_4 obj_10 obj_19)
   deleted: (pred_12 obj_10)
   added: (pred_12 obj_19)
   goals met: 0 of 1
2. (op_1 obj_19 obj_13)
   deleted: (pred_1 obj_13 obj_19) (pred_8)
   added: (pred_2 obj_13)
   goals met: 0 of 1
3. (op_2 obj_19 obj_11 obj_13 obj_18)
   deleted: (pred_5 obj_11)
   added: (pred_3 obj_11)
   goals met: 0 of 1
4. (op_4 obj_19 obj_11)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_11)
   goals met: 0 of 1
5. (op_4 obj_11 obj_01)
   deleted: (pred_12 obj_11)
   added: (pred_12 obj_01)
   goals met: 0 of 1
6. (op_5 obj_01 obj_15 obj_13)
   deleted: (pred_2 obj_13) (pred_1 obj_15 obj_01)
   added: (pred_2 obj_15) (pred_1 obj_13 obj_01)
   goals met: 0 of 1
7. (op_4 obj_01 obj_12)
   deleted: (pred_12 obj_01)
   added: (pred_12 obj_12)
   goals met: 0 of 1
8. (op_3 obj_12 obj_15)
   deleted: (pred_2 obj_15)
   added: (pred_8) (pred_1 obj_15 obj_12)
   goals met: 1 of 1
